DataProcessors/Renault_ПереходНаНовуюВерсию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ПереходНаНовуюВерсию</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/DMS_ДоговораПродажАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_ДоговораПродажАвтомобиля</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьАвтомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_РабочиеЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_РабочиеЛисты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>VINАвтомобилей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаID</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапросНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛистЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтересМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныЗакрытияРЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НаборЦветов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапросаНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРабочегоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыРабочихЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязаныйIDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПродажиВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГарантии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАвтомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDCRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ВоронкаПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ВоронкаПродаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЭтапыПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_КлиентскиеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_КлиентскиеДанные</Name>
			<Comment>Черновая временная версия архитектуры</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредложенияИЗамечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыбораМарки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныВыбораМарки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаТекущегоАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаПредыдущегоАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантВЛице</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантПодпись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтказОтКонтакта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СогласиеНаПолучениеSMSДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КатегорииТранспортныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>КатегорииТранспортныхСредств</Name>
			<Comment>Категории транспортных средств согласно "Конвенции о дорожном движении"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>A</Name>
					<Comment>Мотоциклы, мотороллеры и др. мототранспортные средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>B</Name>
					<Comment>Автомобили, разрешённая максимальная масса которых не превышает 3,5 т и число сидячих мест которых, помимо сиденья водителя, не превышает 8</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>C</Name>
					<Comment>Автомобили, за исключением относящихся к категории D, разрешённая максимальная масса которых превышает 3,5 т</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>E</Name>
					<Comment>Cоставы транспортных средств с тягачом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>D</Name>
					<Comment>Автомобили, предназначенные для перевозки пассажиров и имеющие более 8 сидячих мест, помимо сиденья водитедя</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Renault_ПереходНаНовуюВерсию/Ext/ObjectModule.bsl
Функция ПолучитьСписокВерсий() // Возвращает список версий
	
	СписокВерсий = Новый Массив; // Важно соблюдать порядок версий в массиве
	СписокВерсий.Добавить("");
	СписокВерсий.Добавить("2.7");
	СписокВерсий.Добавить("2.7.1");
	СписокВерсий.Добавить("2.7.001");
	//СписокВерсий.Добавить("2.7.002");
	СписокВерсий.Добавить("2.7.01.02");
	СписокВерсий.Добавить("2.7.01.03");
	СписокВерсий.Добавить("2.7.01.04");
	СписокВерсий.Добавить("2.7.01.05");
	СписокВерсий.Добавить("2.7.01.06");
	СписокВерсий.Добавить("2.7.01.07");
	СписокВерсий.Добавить("2.7.01.08");
	СписокВерсий.Добавить("2.7.01.09");
	СписокВерсий.Добавить("2.7.01.10");
	СписокВерсий.Добавить("2.7.01.11");
	СписокВерсий.Добавить("2.7.01.12");
	СписокВерсий.Добавить("2.7.01.13");
	СписокВерсий.Добавить("2.7.01.14");
	СписокВерсий.Добавить("2.7.01.15");
	СписокВерсий.Добавить("2.7.01.16");
	СписокВерсий.Добавить("2.7.01.17");
	СписокВерсий.Добавить("2.7.01.18");
	СписокВерсий.Добавить("2.7.02.01");
	СписокВерсий.Добавить("2.7.02.02");
	СписокВерсий.Добавить("2.7.02.03");
	СписокВерсий.Добавить("2.7.02.04");
	СписокВерсий.Добавить("2.7.02.05");
	СписокВерсий.Добавить("2.7.02.06");
	СписокВерсий.Добавить("2.7.02.07");
	СписокВерсий.Добавить("2.7.02.08");
	СписокВерсий.Добавить("2.7.02.09");
	СписокВерсий.Добавить("2.7.02.10");
	СписокВерсий.Добавить("2.7.02.11");
	СписокВерсий.Добавить("2.7.02.12");
	СписокВерсий.Добавить("2.7.02.13");
	СписокВерсий.Добавить("2.7.02.14");
	СписокВерсий.Добавить("2.7.02.15");
	СписокВерсий.Добавить("2.7.02.16");
	СписокВерсий.Добавить("2.7.02.17");
	СписокВерсий.Добавить("2.7.02.18");
	СписокВерсий.Добавить("2.7.02.19");
	СписокВерсий.Добавить("2.7.02.20");
	СписокВерсий.Добавить("2.7.02.21");
	СписокВерсий.Добавить("2.7.02.22");
	СписокВерсий.Добавить("2.7.02.23");
	СписокВерсий.Добавить("2.7.02.24");
	Возврат СписокВерсий;
	
КонецФункции

Функция ВыполнитьОбновление(Версия) Экспорт
	
	Перем Результат;
	
	спВерсии = ПолучитьСписокВерсий();
	ТекВерсия = Константы.Renault_Версия.Получить();
	СтарыйИндекс = спВерсии.Найти(ТекВерсия);
	НовыйИндекс = спВерсии.Найти(Версия);
	
	Если СтарыйИндекс = Неопределено или НовыйИндекс = Неопределено Тогда
		Сообщить("Обновление не выполнено, нарушен порядок обновлений",СтатусСообщения.Внимание);
		Возврат Ложь;
	КонецЕсли;
	
	Пока СтарыйИндекс<НовыйИндекс Цикл
		
		СтарыйИндекс = СтарыйИндекс+1;
		ТекВерсия = спВерсии[СтарыйИндекс];
		Сообщить("Выполняется обновление до версии "+ТекВерсия+":",СтатусСообщения.Информация);
		
		Попытка
			ТекстОшибки = "";
			Выполнить("Результат=Версия"+СтрЗаменить(ТекВерсия,".","")+"(ТекстОшибки)");
			Если Результат = Истина Тогда 
				Константы.Renault_Версия.Установить(ТекВерсия);
				Сообщить("Обновление завершено успешно",СтатусСообщения.Информация);
			Иначе
				Сообщить("Обновление не завершено"+Символы.ПС+ТекстОшибки,СтатусСообщения.Внимание);
				Возврат Ложь
			КонецЕсли;
		Исключение
			Сообщить("Обновление не завершено"+Символы.ПС+ОписаниеОшибки(), СтатусСообщения.Внимание);
			Возврат Ложь
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

//обновления
//******************************************************************************************************

Функция Версия27(ТекстОшибки)
	
	//1. Перенос настроек по запчастям
	Сообщить(Символы.Таб+"- перенос настроек по запчастям",СтатусСообщения.Информация);

    СтарыеНастройки = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза;
    НовыеНастройки = Справочники.Renault_НастройкиПодсистемыЗапчасти.ЭтаБаза.ПолучитьОбъект();

    НовыеНастройки.ТипЦенPCL         = СтарыеНастройки.PCLПродажа;
    НовыеНастройки.ТипЦенPNC         = СтарыеНастройки.PNCЗакупСкладская;
    НовыеНастройки.ТипЦенPNCU        = СтарыеНастройки.PNCЗакупСрочная;
    НовыеНастройки.КаталогRenault    = СтарыеНастройки.Каталог_Renault;
    НовыеНастройки.КонтрагентRenault = СтарыеНастройки.ОсновнойПоставщик;
    НовыеНастройки.СкладRParts       = СтарыеНастройки.ОсновнойСкладРеализации;
    НовыеНастройки.ТипЦенRParts      = СтарыеНастройки.ОптоваяЦена;
    Попытка
        НовыеНастройки.Записать();
    Исключение
        ТекстОшибки=ТекстОшибки+?(ТекстОшибки="","",Символы.ПС)+НСтр("ru = 'Не удалось записать настройки'; en = 'Cannot write settings'");
        ТекстОшибки=ТекстОшибки+?(ТекстОшибки="","",Символы.ПС)+ОписаниеОшибки();
		Возврат Ложь
    КонецПопытки;
	
	//2. Обновление справочника Renault_СлужебныеНастройкиБазыДанных
	Сообщить(Символы.Таб+"- обновление справочника Renault_СлужебныеНастройкиБазыДанных",СтатусСообщения.Информация);
	Попытка
		Спр=Справочники.Renault_СлужебныеНастройкиБазыДанных.LADA.ПолучитьОбъект();
		Спр.Наименование="LADA";
		Спр.Записать();
		
		Спр=Справочники.Renault_СлужебныеНастройкиБазыДанных.RENAULT.ПолучитьОбъект();
		Спр.Наименование="RENAULT";
		Спр.Записать();
	Исключение
		ТекстОшибки=ТекстОшибки+?(ТекстОшибки="","",Символы.ПС)+ОписаниеОшибки();
		Возврат Ложь
	КонецПопытки;	
	
	Возврат Истина;
	
КонецФункции

Функция Версия271(ТекстОшибки)
	
	Возврат Истина;
	
КонецФункции //пропуск

Функция Версия27001(ТекстОшибки, ПроверятьПропущенные = Истина)
	
	// 1. заполним виды события
	Сообщить(Символы.Таб+"- заполнение Видов Событий",СтатусСообщения.Информация);
	Попытка	
		Справочники.CRM_ВидыСобытий.ПроверитьИЗаполнитьОбласти();
	Исключение
		ТекстОшибки=ТекстОшибки+?(ТекстОшибки="","",Символы.ПС)+ОписаниеОшибки();
		Возврат Ложь
	КонецПопытки;	
	
	// 2. Заполняем "Трансмиссия" в регистре Renault_ДопИнформацияПоВерсиям
	Сообщить(Символы.Таб + "- обновление регистра Renault_ДопИнформацияПоВерсиям", СтатусСообщения.Информация);
	Попытка
		ЕстьНастройкиПодключения = Ложь;
		Если ЗначениеЗаполнено(ПараметрыСеанса.DMS_Бренд) Тогда
			Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
			Если НЕ Настройки.ИспользоватьHTTPСервисы Тогда
				Если ЗначениеЗаполнено(Настройки.АдресWsGate) И ЗначениеЗаполнено(Настройки.ПарольДоступаКВебСервисам) И ЗначениеЗаполнено(Настройки.ЛогинДоступаКВебСервисам) Тогда
					ЕстьНастройкиПодключения = Истина;
				КонецЕсли;
			Иначе
				Если ЗначениеЗаполнено(Настройки.HTTP_URL) И ЗначениеЗаполнено(Настройки.HTTP_ServiceName) И ЗначениеЗаполнено(Настройки.ПарольДоступаКВебСервисам) И ЗначениеЗаполнено(Настройки.ЛогинДоступаКВебСервисам) Тогда
					ЕстьНастройкиПодключения = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ЕстьНастройкиПодключения Тогда
			Renault_ЗагрузкаТарифа.ЗагрузитьМодели(Дата("00010101"));
			Renault_ЗагрузкаТарифа.ЗагрузитьНастройкиПоМаркам(Дата("00010101"));
			Renault_ЗагрузкаТарифа.ЗагрузитьВерсии(Дата("00010101"));
		Иначе
			Сообщить("Не удалось загрузить тариф на автомобили. Запустите загрузку после заполнения настроек подключения.");
		КонецЕсли;
	Исключение
		//ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", Символы.ПС) + ОписаниеОшибки();
		Сообщить("Не удалось загрузить тариф на автомобили. Запустите загрузку после заполнения настроек подключения.");
	КонецПопытки;
	
	// 3. Добавили предопределенные элементы в справочник Renault_ПредложенияПоРекламациям
	// Пометим дублирующиеся наименования на удаление
	Сообщить(Символы.Таб+"- обновление справочника Renault_ПредложенияПоРекламациям",СтатусСообщения.Информация);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_ПредложенияПоРекламациям.Наименование
	               |ПОМЕСТИТЬ Дубли
	               |ИЗ
	               |	Справочник.Renault_ПредложенияПоРекламациям КАК Renault_ПредложенияПоРекламациям
	               |ГДЕ
	               |	НЕ Renault_ПредложенияПоРекламациям.ЭтоГруппа
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_ПредложенияПоРекламациям.Наименование
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(1) > 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Renault_ПредложенияПоРекламациям.Ссылка,
	               |	Renault_ПредложенияПоРекламациям.Наименование
	               |ПОМЕСТИТЬ КУдалению
	               |ИЗ
	               |	Справочник.Renault_ПредложенияПоРекламациям КАК Renault_ПредложенияПоРекламациям
	               |ГДЕ
	               |	Renault_ПредложенияПоРекламациям.Наименование В
	               |			(ВЫБРАТЬ
	               |				Дубли.Наименование
	               |			ИЗ
	               |				Дубли КАК Дубли)
	               |	И НЕ Renault_ПредложенияПоРекламациям.Предопределенный
	               |	И НЕ Renault_ПредложенияПоРекламациям.ЭтоГруппа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КУдалению.Ссылка
	               |ИЗ
	               |	КУдалению КАК КУдалению
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Renault_ПредложенияПоРекламациям КАК Renault_ПредложенияПоРекламациям
	               |		ПО КУдалению.Наименование = Renault_ПредложенияПоРекламациям.Наименование
	               |			И (Renault_ПредложенияПоРекламациям.Предопределенный)
	               |			И (НЕ Renault_ПредложенияПоРекламациям.ЭтоГруппа)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Попытка 
			Выборка.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина,Ложь); 
		Исключение
			ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", Символы.ПС) + ОписаниеОшибки();
			Возврат Ложь;
		КонецПопытки;	
	КонецЦикла;
	
	// 4. Проверим правила префиксации (код взял из обработки ОбновлениеИнформационнойБазы)
	Сообщить(Символы.Таб+"- проверка правил префиксации",СтатусСообщения.Информация);
	Попытка
		ЗаполнятьПрава = Ложь;
		ЭтотУзел = ПланыОбмена.УдаленныеПодразделения.ЭтотУзел().Ссылка;
		ЭтотУзелИБ = ЭтотУзел.ИнформационнаяБаза;
		Если НЕ ЭтотУзелИБ.Пустая() Тогда
			РодительЭтотУзелИБ = ЭтотУзелИБ.Родитель; // верный родитель в соотв.со структурой ИБ
			
			ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
			// проверка - если нет узла -> родитель по Структуре ИБ, но подчиненный по узлам, то отцепления не было
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	УдаленныеПодразделения.Ссылка КАК УзелОбмена
			|ИЗ
			|	ПланОбмена.УдаленныеПодразделения КАК УдаленныеПодразделения
			|ГДЕ
			|	УдаленныеПодразделения.Ссылка <> &ЭтотУзел
			|	И УдаленныеПодразделения.Ссылка <> &ГлавныйУзел
			|	И УдаленныеПодразделения.ИнформационнаяБаза = &РодительЭтотУзелИБ ";
			Запрос.УстановитьПараметр("ЭтотУзел",ЭтотУзел);
			Запрос.УстановитьПараметр("ГлавныйУзел",ГлавныйУзел);
			Запрос.УстановитьПараметр("РодительЭтотУзелИБ",РодительЭтотУзелИБ);
			Выборка = Запрос.Выполнить().Выбрать();
			Если НЕ Выборка.Следующий() Тогда
				ЗаполнятьПрава = Истина; 
			КонецЕсли;
		Иначе
			ЗаполнятьПрава = Истина; // не с чем сравнить
		КонецЕсли; 	
		Если ЗаполнятьПрава Тогда
			Объект=ПланыВидовХарактеристик.ПраваИНастройки.СоздатьЭлемент();
			Объект.ПроверитьПравилаПрефиксации();
		КонецЕсли;
	Исключение
		ТекстОшибки=ТекстОшибки+?(ТекстОшибки="","",Символы.ПС)+ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
	
	//5.добавление областей события
	Сообщить(Символы.Таб+"- обработка событий",СтатусСообщения.Информация);
	Запрос=Новый Запрос("Выбрать Ссылка Из Задача.Renault_События ГДЕ НЕ ПометкаУдаления И Ссылка Не В(Выбрать Ссылка Из Задача.Renault_События.ОбластиПрименения)");
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Задача=Выборка.Ссылка.ПолучитьОбъект();
		Задача.ОбластиПрименения.Добавить().ОбластьПрименения=Справочники.CRM_ВидыСобытий.ПолучитьОбласть(Задача.ВидСобытия);
		Попытка Задача.Записать()
		Исключение
			ТекстОшибки=ТекстОшибки+?(ТекстОшибки="","",Символы.ПС)+ОписаниеОшибки();
			Возврат Ложь
		КонецПопытки;	
	КонецЦикла;	
	
	////6. Конвертация событий
	//Сообщить(Символы.Таб+"- конвертация событий",СтатусСообщения.Информация);
	//Запрос=Новый Запрос("Выбрать Ссылка Из Документ.CRM_СобытияПоРабочимЛистам ГДЕ ДатаНапоминания>=&Дата И НЕ ПометкаУдаления");
	//Запрос.УстановитьПараметр("Дата",НачалоГода(ТекущаяДата()));
	//Выборка=Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл 
	//	Если КонвертироватьСобытие(Выборка.Ссылка, ТекстОшибки) = Ложь Тогда
	//		Возврат Ложь;
	//	КонецЕсли;
	//КонецЦикла;
	
	Возврат Истина; //должно вернуть истина если обновление завершено успешно
	
КонецФункции

Функция Версия270102(ТекстОшибки)
	
	//Корректировка профилей
	Сообщить("Выполняется корректировка профилей клиентов");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ПрофилиКлиентов.Ссылка
	|ИЗ
	|	Справочник.Renault_ПрофилиКлиентов КАК Renault_ПрофилиКлиентов
	|УПОРЯДОЧИТЬ ПО Renault_ПрофилиКлиентов.Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПрофильОб = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаКлиент ИЗ ПрофильОб.Клиенты Цикл
			Если ЗначениеЗаполнено(СтрокаКлиент.Клиент) Тогда
				СтрокаКлиент.ТипКлиента = ?(ТипЗнч(СтрокаКлиент.Клиент) = Тип("СправочникСсылка.Контрагенты"), "Контрагент", "Потенциальный");
			КонецЕсли;
		КонецЦикла;
		ПрофильОб.Записать();
	КонецЦикла;
	
	//Заполнение марок, моделей по корп. продажам
	Сообщить("Выполняется заполнение марок, моделий для корп. продаж");
	Справочники.Renault_КорпоративныеКлиенты_МаркиМодели.ЗаполнитьМаркиМодели();
	
	//Заполнение настроек подключения http
	Сообщить("Выполняется заполнение настроек подключения http");
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных.RENAULT;
	Если Не ЗначениеЗаполнено(СокрЛП(Настройки.HTTP_URL)) Тогда
		
		НастройкиОбъект = Настройки.ПолучитьОбъект();
		НастройкиОбъект.HTTP_URL = "gate.rnlt.ru";
		НастройкиОбъект.HTTP_ServiceName = "/renault-ws-gate/hs/traffic/";
		НастройкиОбъект.HTTP_port = 80;
		НастройкиОбъект.ИспользоватьЗащищенноеСоединение = Ложь;
		
		НастройкиОбъект.Записать();
		
	КонецЕсли;
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция Версия270103(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270104(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270105(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270106(ТекстОшибки)
	
	//Продажи
	Сообщить(Символы.Таб + "- выполняется регистрация данных CRM_Sales", СтатусСообщения.Информация);
	
	Выборка = ПланыОбмена.Renault_CRM.Выбрать();
	ЭтаБаза = ПланыОбмена.Renault_CRM.ЭтотУзел();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ЭтаБаза Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, Метаданные.РегистрыСведений.Renault_Трафик);
	ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, Метаданные.РегистрыСведений.Renault_РабочиеЛисты);
	ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, Метаданные.РегистрыСведений.CRM_ВоронкаПродаж);
	ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, Метаданные.РегистрыСведений.Renault_СтатистикаВыполненияЭтаповПродаж);
	ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, Метаданные.Документы.CRM_ЗаписьНаВыдачу);
	
	//Сервис
	Сообщить(Символы.Таб + "- выполняется регистрация данных автосервиса", СтатусСообщения.Информация);
	
	Выборка = ПланыОбмена.Renault_Автосервис.Выбрать();
	ЭтаБаза = ПланыОбмена.Renault_Автосервис.ЭтотУзел();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ЭтаБаза Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, Метаданные.Документы.Renault_CRM_ОбращениеВАвтоСервис);
	ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, Метаданные.Документы.Renault_CRM_ЗаявкаНаСервис);
	ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, Метаданные.Документы.ЗаказНаряд);
	ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, Метаданные.Документы.Renault_СертификатКонтроля);
	
	Возврат Истина;
	
КонецФункции

Функция Версия270107(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270108(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270109(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270110(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270111(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270112(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270113(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270114(ТекстОшибки)
	
	// В регистре "DMS_ДоговораПродажАвтомобиля" переименовано измерение "Автомобиль1" в "Автомобиль" и ресурс "Автомобиль" в "УдалитьАвтомобиль"
	// Перенесем данные из ресурса в измерение
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	DMS_ДоговораПродажАвтомобиля.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.DMS_ДоговораПродажАвтомобиля КАК DMS_ДоговораПродажАвтомобиля
	|
	|СГРУППИРОВАТЬ ПО
	|	DMS_ДоговораПродажАвтомобиля.Регистратор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.DMS_ДоговораПродажАвтомобиля.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();	
		
		Для Каждого Запись Из НаборЗаписей Цикл
			
			Если ЗначениеЗаполнено(Запись.УдалитьАвтомобиль) Тогда
				Запись.Автомобиль = Запись.УдалитьАвтомобиль;
			КонецЕсли;
			
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
	КонецЦикла;
	
	Узел = Неопределено;
	Выборка = ПланыОбмена.Renault_Автосервис.Выбрать();
	ЭтаБаза = ПланыОбмена.Renault_Автосервис.ЭтотУзел();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ЭтаБаза Тогда
			Узел = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Если Узел <> Неопределено Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Метаданные.Справочники.ВидыРемонта);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция Версия270115(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270116(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270117(ТекстОшибки)
	
	//Продажи
	Сообщить(Символы.Таб + "- выполняется регистрация данных CRM_Sales", СтатусСообщения.Информация);
	
	Узел = Неопределено;
	Выборка = ПланыОбмена.Renault_CRM.Выбрать();
	ЭтаБаза = ПланыОбмена.Renault_CRM.ЭтотУзел();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ЭтаБаза Тогда
			Узел = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Если Узел <> Неопределено Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Метаданные.Документы.РеализацияТоваров);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция Версия270118(ТекстОшибки)
	
	//Продажи
	
	//Перенос рабочих листов из регистра сведений в документ
	
	Сообщить("Выполняется перенос рабочих листов из регистра сведений в документ.");
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_РабочиеЛисты.ID КАК ID,
		|	Renault_РабочиеЛисты.IDK КАК IDK,
		|	Renault_РабочиеЛисты.Отдел КАК Отдел,
		|	Renault_РабочиеЛисты.Подразделение КАК Подразделение,
		|	Renault_РабочиеЛисты.ДилерскийЦентр КАК ДилерскийЦентр,
		|	Renault_РабочиеЛисты.VINАвтомобилей КАК VINАвтомобилей,
		|	Renault_РабочиеЛисты.Важность КАК Важность,
		|	Renault_РабочиеЛисты.ДатаID КАК ДатаID,
		|	Renault_РабочиеЛисты.ЗапросНаЗакрытие КАК ЗапросНаЗакрытие,
		|	Renault_РабочиеЛисты.Клиент КАК Клиент,
		|	Renault_РабочиеЛисты.КомментарийЗакрытия КАК КомментарийЗакрытия,
		|	Renault_РабочиеЛисты.Комплектация КАК Комплектация,
		|	Renault_РабочиеЛисты.ЛистЗакрыт КАК ЛистЗакрыт,
		|	Renault_РабочиеЛисты.МаркаАвтомобиля КАК МаркаАвтомобиля,
		|	Renault_РабочиеЛисты.МодельАвтомобиля КАК МодельАвтомобиля,
		|	Renault_РабочиеЛисты.ПервичныйИнтересМодель КАК ПервичныйИнтересМодель,
		|	Renault_РабочиеЛисты.ПричинаЗакрытия КАК ПричинаЗакрытия,
		|	Renault_РабочиеЛисты.Сотрудник КАК Сотрудник,
		|	Renault_РабочиеЛисты.Цвет КАК Цвет,
		|	Renault_РабочиеЛисты.АвторЗакрытия КАК АвторЗакрытия,
		|	Renault_РабочиеЛисты.ТипТрафика КАК ТипТрафика,
		|	Renault_РабочиеЛисты.ЖелаемаяДатаДоставки КАК ЖелаемаяДатаДоставки,
		|	Renault_РабочиеЛисты.ТипКлиента КАК ТипКлиента,
		|	Renault_РабочиеЛисты.ДатаЗапросаНаЗакрытие КАК ДатаЗапросаНаЗакрытие,
		|	Renault_РабочиеЛисты.ТипРабочегоЛиста КАК ТипРабочегоЛиста,
		|	Renault_РабочиеЛисты.СвязаныйIDK КАК СвязаныйIDK,
		|	Renault_РабочиеЛисты.ПродажаБУ КАК ПродажаБУ,
		|	Renault_РабочиеЛисты.АвтомобильБУ КАК АвтомобильБУ,
		|	Renault_РабочиеЛисты.ТипПродажиВыкупа КАК ТипПродажиВыкупа,
		|	Renault_РабочиеЛисты.Гарантия КАК Гарантия,
		|	Renault_РабочиеЛисты.СрокГарантии КАК СрокГарантии,
		|	Renault_РабочиеЛисты.КомментарийАвтомобиль КАК КомментарийАвтомобиль,
		|	Renault_РабочиеЛисты.IDТрафика КАК IDТрафика,
		|	Renault_РабочиеЛисты.IDCRM КАК IDCRM
		|ИЗ
		|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_РабочийЛист КАК Renault_РабочийЛист
		|		ПО Renault_РабочийЛист.ID = Renault_РабочиеЛисты.ID
		|		И Renault_РабочийЛист.IDK = Renault_РабочиеЛисты.IDK
		|		И Renault_РабочийЛист.Отдел = Renault_РабочиеЛисты.Отдел
		|		И Renault_РабочийЛист.Подразделение = Renault_РабочиеЛисты.Подразделение
		|		И Renault_РабочийЛист.ДилерскийЦентр = Renault_РабочиеЛисты.ДилерскийЦентр
		|ГДЕ
		|	Renault_РабочиеЛисты.ДатаID > &ДатаНач
		|	И Renault_РабочийЛист.Ссылка ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ДатаНач", '20190101');
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Сч=0;
	КоличествоЗаписей = РезультатЗапроса.Количество();
	ЕстьОшибка = Ложь;
	ТекДата = ТекущаяДата();
	
	Для каждого Стр Из РезультатЗапроса Цикл
		
		Сч=Сч+1;
		
		НаборЗаписей = РегистрыСведений.Renault_РабочиеЛисты.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ID.Установить(Стр.ID);
		НаборЗаписей.Отбор.IDK.Установить(Стр.IDK);
		НаборЗаписей.Отбор.Отдел.Установить(Стр.Отдел);
		НаборЗаписей.Отбор.Подразделение.Установить(Стр.Подразделение);
		НаборЗаписей.Отбор.ДилерскийЦентр.Установить(Стр.ДилерскийЦентр);
		НаборЗаписей.Прочитать();
		
		Для каждого Запись Из НаборЗаписей Цикл
		
			Док = Документы.Renault_РабочийЛист.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(Док, Запись);
			Док.Дата = Запись.ДатаID;
			Док.УстановитьНовыйНомер();
			
			Попытка
				Док.Записать(РежимЗаписиДокумента.Запись);
				Сообщить("Обработано " + Сч + " из " + КоличествоЗаписей);
			Исключение
				ЕстьОшибка = Истина;
			КонецПопытки;
			
			Если ЕстьОшибка Тогда
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецЕсли; 
			
		КонецЦикла;
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

Функция Версия270201(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270202(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270203(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270204(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270205(ТекстОшибки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CRM_ВоронкаПродаж.IDK,
	|	РЛ.ДилерскийЦентр
	|ИЗ
	|	РегистрСведений.CRM_ВоронкаПродаж КАК CRM_ВоронкаПродаж
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_РабочийЛист КАК РЛ
	|	ПО РЛ.IDK = CRM_ВоронкаПродаж.IDK
	|ГДЕ
	|	CRM_ВоронкаПродаж.ДилерскийЦентр = &ПустойДилерскийЦентр
	|	И РЛ.ДилерскийЦентр <> &ПустойДилерскийЦентр";
	Запрос.УстановитьПараметр("ПустойДилерскийЦентр", Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Набор = РегистрыСведений.CRM_ВоронкаПродаж.СоздатьНаборЗаписей();
		Набор.Отбор.IDK.Установить(Выборка.IDK);
		Набор.Прочитать();
		Для Каждого Запись ИЗ Набор Цикл
			Запись.ДилерскийЦентр = Выборка.ДилерскийЦентр;
		КонецЦикла;
		Набор.Записать();
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция Версия270206(ТекстОшибки)
	
	//Сервис
	//Сообщить(Символы.Таб + "- выполняется регистрация данных CRM_Sales", СтатусСообщения.Информация);
	
	Узел = Неопределено;
	Выборка = ПланыОбмена.Renault_Автосервис.Выбрать();
	ЭтаБаза = ПланыОбмена.Renault_Автосервис.ЭтотУзел();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ЭтаБаза Тогда
			Узел = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Если Узел <> Неопределено Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Метаданные.РегистрыСведений.Renault_СобственныеКонтрагенты);
	КонецЕсли;
	
	Выб = Справочники.CRM_ВидыСобытий.Выбрать();
	Пока Выб.Следующий() Цикл
		Если Выб.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		СпрОб = Выб.ПолучитьОбъект();
		СпрОб.ОбменДанными.Загрузка = Истина;
		СпрОб.ДлительностьПоУмолчанию = 20;
		СпрОб.Записать();
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция Версия270207(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270208(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270209(ТекстОшибки)
	
	Узел = Неопределено;
	Выборка = ПланыОбмена.Renault_CRM.Выбрать();
	ЭтаБаза = ПланыОбмена.Renault_CRM.ЭтотУзел();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ЭтаБаза Тогда
			Узел = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Если Узел <> Неопределено Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Метаданные.Справочники.СкладыКомпании);
	КонецЕсли;
	
	Константы.Renault_ДатаАктуальностиТарифаНаАвтомобили.Установить('20200101');
	
	Возврат Истина;
	
КонецФункции

Функция Версия270210(ТекстОшибки)
	
	//1. заполняем...
	Сообщить(Символы.Таб+"- выполняется ...",СтатусСообщения.Информация);
	Попытка
		Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных.RENAULT;
		НастройкиОбъект = Настройки.ПолучитьОбъект();
		НастройкиОбъект.АдресWebSocket = "http://84.201.147.128:8888";
		НастройкиОбъект.URL_ОПД = "dms.rnlt.ru";
		НастройкиОбъект.Сервер_ОПД = "/conso/hs/ExternalIntegration/consent/";
		НастройкиОбъект.Порт_ОПД = "443";
		НастройкиОбъект.ЛогинОПД = "ru_admin";
		НастройкиОбъект.ПарольОПД = 123;
		НастройкиОбъект.Записать();
	Исключение
		ТекстОшибки = ТекстОшибки+?(ТекстОшибки="","",Символы.ПС)+ОписаниеОшибки();
		Возврат Ложь
	КонецПопытки;	
	
	Возврат Истина //должно вернуть истина если обновление завершено успешно
КонецФункции

Функция Версия270211(ТекстОшибки)
	Возврат Истина;
КонецФункции

Функция Версия270212(ТекстОшибки)
	
	//Создадим новую модель
	Поиск = Справочники.Модели.НайтиПоРеквизиту("Артикул", "HJD");
	Если НЕ ЗначениеЗаполнено(Поиск) Тогда
		НовМодель = Справочники.Модели.СоздатьЭлемент();
	Иначе
		НовМодель = Поиск.ПолучитьОбъект();
	КонецЕсли;
	НовМодель.УстановитьНовыйКод();
	НовМодель.Наименование = "Новый Duster";
	НовМодель.НаименованиеПолное = "Новый Duster";
	НовМодель.ВалютаУчета        = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	НовМодель.Артикул = "HJD";
	НовМодель.КатегорияТС = Справочники.КатегорииТранспортныхСредств.АвтомобилиЛегковые;
	НовМодель.КатегорияТСКОДД = Перечисления.КатегорииТранспортныхСредств.B;
	НовМодель.Записать();
	
	НовИнтерес = Справочники.CRM_ПервичныйИнтерес.СоздатьЭлемент();
	НовИнтерес.Модель = НовМодель.Ссылка;
	НовИнтерес.Наименование = "Новый Duster";
	НовИнтерес.Записать();
	
	МаркаАвто = Справочники.CRM_МаркаАвтомобиля.RENAULT.ПолучитьОбъект();
	НовСтр = МаркаАвто.МоделиАвтомобилей.Добавить();
	НовСтр.Модель = НовМодель.Ссылка;
	НовСтр = МаркаАвто.МоделиАвтомобилейПервичныйИнтерес.Добавить();
	НовСтр.Модель = НовМодель.Ссылка;
	НовСтр = МаркаАвто.МоделиАвтомобилейКоммерческоеПредложение.Добавить();
	НовСтр.Модель = НовМодель.Ссылка;
	НовСтр = МаркаАвто.МоделиАвтомобилейАвтосклад.Добавить();
	НовСтр.Модель = НовМодель.Ссылка;
	МаркаАвто.Записать();
	
	Настройка = Справочники.Renault_СлужебныеНастройкиБазыДанных.RENAULT.ПолучитьОбъект();
	Настройка.АдресWsGate = "http://gate.rnlt.ru/renault-ws-gate/";
	Настройка.HTTP_URL = "gate.rnlt.ru";
	Настройка.HTTP_port = 80;
	Настройка.URL_ОПД = "dms.rnlt.ru";
	Настройка.АдресDistriNetWSDL = "https://gate.rnlt.ru/renault-ws-gate/";
	Настройка.КЦАдресСервера = "http://gate.rnlt.ru/renault-ws-gate/";
	Настройка.АдресWsCentral = "http://gate.rnlt.ru/renault-webservices/";
	Настройка.АдресWebSocket = "http://84.201.147.128:8888";
	Настройка.Записать();
	
	Выб = Справочники.Renault_НастройкиFacturon.Выбрать();
	Если Выб.Следующий() Тогда
		Настройка = Выб.Ссылка.ПолучитьОбъект();
		Настройка.АдресWEBСервиса = "http://gate.rnlt.ru/renault-ws-gate/";
		Настройка.Записать();
	КонецЕсли;
	
	Выб = Справочники.Renault_НастройкиОбменаСРеноПартс.Выбрать();
	Если Выб.Следующий() Тогда
		Настройка = Выб.Ссылка.ПолучитьОбъект();
		Настройка.Сервер = "gate.rnlt.ru";
		Настройка.Путь = "/dms-rparts/hs/rparts/";
		Настройка.Порт = 80;
		Настройка.Записать();
	КонецЕсли;
	
	Настройка = Справочники.Renault_ПараметрыПодключенияКСервисам.WSGate.ПолучитьОбъект();
	Настройка.АдресСервера = "http://gate.rnlt.ru/renault-ws-gate/ws/";
	Настройка.Записать();
	
	Выб = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Пока Выб.Следующий() Цикл
		Об = Выб.Ссылка.ПолучитьОбъект();
		НовСтр = Об.ПервичныйИнтерес.Добавить();
		НовСтр.ПервичныйИнтерес = НовИнтерес;
		Об.Записать();
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция Версия270213(ТекстОшибки)
	
	//Обновление 08.07.2021 Зубков
	//Эта функция больше не актуальна, реквизит удален.
	Возврат Истина;
	
	//Перенесем дату согласия из справочника "Контрагенты" в регистр "CRM_КлиентскиеДанные"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_КлиентскиеДанные КАК CRM_КлиентскиеДанные
	|	ПО CRM_КлиентскиеДанные.Клиент = Контрагенты.Ссылка
	|ГДЕ Контрагенты.Удалить_СогласиеНаПолучениеSMSДата <> &ПустаяДата
	|	И НЕ CRM_КлиентскиеДанные.Клиент ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Выборка = Запрос.Выполнить().Выбрать();
	Набор = РегистрыСведений.CRM_КлиентскиеДанные.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		Набор.Отбор.Клиент.Установить(Выборка.Ссылка);
		Набор.Прочитать();
		Запись = Набор[0];
		Запись.СогласиеНаПолучениеSMSДата = Выборка.Ссылка.Удалить_СогласиеНаПолучениеSMSДата;
		Набор.Записать();
	КонецЦикла;
	
	НовИнтересСсылка = Справочники.CRM_ПервичныйИнтерес.НайтиПоНаименованию("Новый Duster");
	НовМодель = Справочники.Модели.НайтиПоРеквизиту("Артикул", "JD1");
	Если НовИнтересСсылка = Неопределено Тогда
		НовИнтерес = Справочники.CRM_ПервичныйИнтерес.СоздатьЭлемент();
		НовИнтерес.Модель = НовМодель;
		НовИнтерес.Наименование = "Новый Duster";
		НовИнтерес.Записать();
		НовИнтересСсылка = НовИнтерес.Ссылка;
	Иначе
		Если ЗначениеЗаполнено(НовМодель) Тогда
			НовИнтерес = НовИнтересСсылка.ПолучитьОбъект();
			НовИнтерес.Модель = НовМодель;
			НовИнтерес.Записать();
		КонецЕсли;
	КонецЕсли;
	
	МодельHJD = Справочники.Модели.НайтиПоРеквизиту("Артикул", "HJD");
	МодельJD1 = Справочники.Модели.НайтиПоРеквизиту("Артикул", "JD1");
	
	МаркаАвто = Справочники.CRM_МаркаАвтомобиля.RENAULT.ПолучитьОбъект();
	НовСтр = МаркаАвто.МоделиАвтомобилей.Найти(МодельHJD, "Модель");
	Если НовСтр <> Неопределено Тогда
		НовСтр.Модель = МодельJD1;
	Иначе
		НовСтр = МаркаАвто.МоделиАвтомобилей.Добавить();
		НовСтр.Модель = МодельJD1;
	КонецЕсли;
	НовСтр = МаркаАвто.МоделиАвтомобилейПервичныйИнтерес.Найти(МодельHJD, "Модель");
	Если НовСтр <> Неопределено Тогда
		НовСтр.Модель = МодельJD1;
	Иначе
		НовСтр = МаркаАвто.МоделиАвтомобилейПервичныйИнтерес.Добавить();
		НовСтр.Модель = МодельJD1;
	КонецЕсли;
	НовСтр = МаркаАвто.МоделиАвтомобилейКоммерческоеПредложение.Найти(МодельHJD, "Модель");
	Если НовСтр <> Неопределено Тогда
		НовСтр.Модель = МодельJD1;
	Иначе
		НовСтр = МаркаАвто.МоделиАвтомобилейКоммерческоеПредложение.Добавить();
		НовСтр.Модель = МодельJD1;
	КонецЕсли;
	НовСтр = МаркаАвто.МоделиАвтомобилейАвтосклад.Найти(МодельJD1, "Модель");
	Если НовСтр = Неопределено Тогда
		НовСтр = МаркаАвто.МоделиАвтомобилейАвтосклад.Добавить();
		НовСтр.Модель = МодельJD1;
	КонецЕсли;
	МаркаАвто.Записать();
	
	Выб = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Пока Выб.Следующий() Цикл
		Об = Выб.Ссылка.ПолучитьОбъект();
		НовСтр = Об.ПервичныйИнтерес.Найти(НовИнтересСсылка, "ПервичныйИнтерес");
		Если НовСтр <> Неопределено Тогда // уже есть
			Продолжить;
		КонецЕсли;
		НовСтр = Об.ПервичныйИнтерес.Найти(Справочники.CRM_ПервичныйИнтерес.ПустаяСсылка(), "ПервичныйИнтерес");
		Если НовСтр <> Неопределено Тогда // есть строка с пустым значением
			НовСтр.ПервичныйИнтерес = НовИнтересСсылка;
			Об.Записать();
			Продолжить;
		КонецЕсли;
		// нет вообще строки
		НовСтр = Об.ПервичныйИнтерес.Добавить();
		НовСтр.ПервичныйИнтерес = НовИнтересСсылка;
		Об.Записать();
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция Версия270214(ТекстОшибки)
	
	Узел = ПланыОбмена.DMS_DataMart.НайтиПоНаименованию("ЭтаБаза");
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		НовУзел = ПланыОбмена.DMS_DataMart.СоздатьУзел();
		НовУзел.Наименование = "ЭтаБаза";
		НовУзел.Код = 1;
		НовУзел.ЭтотУзел = Ложь;
		НовУзел.Записать();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция Версия270215(ТекстОшибки)
	
	Справочники.DMS_ПереченьОперацийКСиТО.ОбновитьПеречень();
	
	Если Справочники.ВидыСостоянийЗаказНарядов.НайтиПоНаименованию("Не готово") 
		= Справочники.ВидыСостоянийЗаказНарядов.ПустаяСсылка() Тогда
		
		НовыйСтатус =  Справочники.ВидыСостоянийЗаказНарядов.СоздатьЭлемент();
		НовыйСтатус.Наименование = "Не готово";
		НовыйСтатус.НедоступноДляВыбора = Истина;
		НовыйСтатус.Записать();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция Версия270216(ТекстОшибки)
	
	Возврат Истина;
	
КонецФункции

Функция Версия270217(ТекстОшибки)
	
	Возврат Истина;
	
КонецФункции

Функция Версия270218(ТекстОшибки)
	
	Справочники.DMS_НастройкаРегламентныхЗаданий.ОбновитьСправочник();
		
	Возврат Истина;
	
КонецФункции

Функция Версия270219(ТекстОшибки)
	
	Возврат Истина;
	
КонецФункции

Функция Версия270220(ТекстОшибки)
	
	Возврат Истина;
	
КонецФункции

Функция Версия270221(ТекстОшибки)
	
	Константы.DMS_DataMart_ClientID.Установить("8db98ede-95c3-4279-ad70-1aba6ef8f169");
	Константы.DMS_DataMart_ClientSecret.Установить("PkPGsIlGBGfOk-Zrj1SZscY5Z_pvZ8htA470cud38CEy3lO-A35Qd9Ktpd9Jp5jGFc1atX3fhgU5rRFdsvpjNA");
	
	Спр=Справочники.Renault_СлужебныеНастройкиБазыДанных.RENAULT.ПолучитьОбъект();
	Спр.МенеджерКупонов_host = "coupons.renault.ru"; 
	Спр.МенеджерКупонов_login = "dms_api";
	Спр.МенеджерКупонов_passwd = "UkTNNsEu8hwhGc2j"; 
	Спр.МенеджерКупонов_client_id = "1_aoigiraiwow00gcsk4o8skock8g4ssc0o4ko0w48csoockcg0";
	Спр.МенеджерКупонов_client_secret = "526wghce4p0kck8goswscss4o800w8sw0csscgoo0gwgo8cscw";
	Спр.Записать();	
	
	Возврат Истина;
	
КонецФункции

Функция Версия270222(ТекстОшибки)
	
	Возврат Истина;
	
КонецФункции

Функция Версия270223(ТекстОшибки)
	
	Узел = Неопределено;
	Выборка = ПланыОбмена.Renault_Автосервис.Выбрать();
	ЭтаБаза = ПланыОбмена.Renault_Автосервис.ЭтотУзел();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ЭтаБаза Тогда
			Узел = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_СертификатКонтроля.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Renault_СертификатКонтроля КАК Renault_СертификатКонтроля
	|ГДЕ
	|	Renault_СертификатКонтроля.Дата >= &Дата";
	Запрос.УстановитьПараметр("Дата", '20210101');
	Таб = Запрос.Выполнить().Выгрузить();
	Массив = Таб.ВыгрузитьКолонку("Ссылка");
	Если Узел <> Неопределено Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Массив);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаряд.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.ДатаЗакрытия >= &Дата";
	Запрос.УстановитьПараметр("Дата", '20220101');
	Таб = Запрос.Выполнить().Выгрузить();
	Массив = Таб.ВыгрузитьКолонку("Ссылка");
	Если Узел <> Неопределено Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Массив);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция Версия270224(ТекстОшибки)
	
	Возврат Истина;
	
КонецФункции

Функция ВерсияХХХ(ТекстОшибки, ПроверятьПропущенные = Истина) //шаблон
	
	//1. заполняем...
	Сообщить(Символы.Таб+"- выполняется ...",СтатусСообщения.Информация);
	Попытка
		
	Исключение
		ТекстОшибки = ТекстОшибки+?(ТекстОшибки="","",Символы.ПС)+ОписаниеОшибки();
		Возврат Ложь
	КонецПопытки;	
	
	Возврат Истина //должно вернуть истина если обновление завершено успешно
КонецФункции

////вспомогательные
//Функция КонвертироватьСобытие(Док,ТекстОшибки)
//	
//	Если Не ЗначениеЗаполнено(Док) Тогда
//		Возврат Задачи.Renault_События.ПустаяСсылка();
//	КонецЕсли;
//	
//	//поиск
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"Выбрать Первые 1 Ссылка
//	|Из Задача.Renault_События
//	|ГДЕ Дата = &Дата И ВидСобытия=&ВидСобытия И ДилерскийЦентр=&ДилерскийЦентр И Подразделение=&Подразделение И Отдел=&Отдел И Сотрудник=&Сотрудник";
//	Запрос.УстановитьПараметр("Дата",Док.ДатаНапоминания);
//	Запрос.УстановитьПараметр("ВидСобытия",Док.ВидСобытия);
//	Запрос.УстановитьПараметр("ДилерскийЦентр",Док.ДилерскийЦентр);
//	Запрос.УстановитьПараметр("Подразделение",Док.Подразделение);
//	Запрос.УстановитьПараметр("Отдел",Док.Отдел);
//	Запрос.УстановитьПараметр("Сотрудник",Док.Сотрудник);
//	Выборка=Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда Возврат Выборка.Ссылка КонецЕсли;
//	
//	//создание
//	Попытка	
//		
//		Задача=Задачи.Renault_События.СоздатьЗадачу();
//		Задача.Дата=Док.ДатаНапоминания;
//		Задача.ВидСобытия=Док.ВидСобытия;
//		Задача.ДилерскийЦентр=Док.ДилерскийЦентр;
//		Задача.Подразделение=Док.Подразделение;
//		Задача.Отдел=Док.Отдел;
//		Задача.Сотрудник=Док.Сотрудник;
//		Задача.Автор=Док.Автор;
//		Задача.Исполнитель=Док.АвторЗакрытия;
//		Задача.IDK=Док.IDK;
//		
//		Задача.Наименование=?(Док.Комментарий="",Док.ВидСобытия,Док.Комментарий);
//		Задача.Выполнена=Док.Обработано;
//		Задача.Состояние=?(Док.ЗавершеноУспешно,Справочники.Renault_Состояния.ЗавершеноУспешно,"");
//		Задача.ДатаЗакрытия=Док.ДатаЗакрытия;
//		Задача.Комментарий=Док.КомментарийЗакрытия;
//		Задача.Объект=Док.Объект;
//		Задача.ДоговорНаПродажуАвтомобиля=Док.ДоговорНаПродажуАвтомобиля;
//		Задача.Длительность=Док.Длительность;
//		Задача.ЦветФона=Док.ЦветФона;
//		Задача.ЦветТекста=Док.ЦветТекста;
//		Задача.Основание=КонвертироватьСобытие(Док.Основание,ТекстОшибки);
//		Для Каждого Стр Из Док.АвтомобилиДляВыдачи Цикл
//			ЗаполнитьЗначенияСвойств(Задача.АвтомобилиДляВыдачи.Добавить(),Стр)
//		КонецЦикла;	
//		Задача.ДополнительныеСвойства.Вставить("БезКонтроляПрав"); //для записи без контроля прав
//		Задача.Записать();
//		
//	Исключение
//		
//		ТекстОшибки = ТекстОшибки+?(ТекстОшибки="","",Символы.ПС)+ОписаниеОшибки();
//		Возврат Ложь;
//		
//	КонецПопытки;	
//	
//	Возврат Задача.Ссылка;
//	
//КонецФункции
